
print("Данная программа предназначена для вычисления суммы трёх чисел, введённых\nпользователем.")#Выводим задачу программы
first_num = float(input("Введите значение первого числа:"))#Команда для ввода переменной
second_num = float(input("Введите значение второго числа:"))#Команда для ввода переменной
third_num = float(input("Введите значение третьего числа:"))#Команда для ввода переменной
result = first_num + second_num + third_num#подсчёт результата
print("Ваш результат = " + str(result))#вывод рез
print(input("Нажмите клавишу \"Enter\" для окончания работы программы"))#Команда для окончания программы
